
#include <iostream>
///////////////////////////////////////////////////

/*

//Подсказка-заготовка для задания 5а
//Без использования макросов

void VarArgs(int arg1,...)
{
	int number = 0;	//счетчик элементов
	//Объявите указатель на int и инициализируйте его адресом
	//первого аргумента
	int* p = &arg1;
	//Пока не достигнут конец списка:
	// а) печать значения очередного аргумента
	// б) модификация указателя (он должен указывать на
	//следующий аргумент списка)
	// в) увеличить счетчик элементов
	while (*p != 0)
	{
		std::cout << *p;
		p++;
		number++;
	}
	std::cout << "NUMBER" << number;


	//Печать числа элементов

}


*/
